



DHC                                                              S. Zeng
Internet-Draft                                                   B. Volz
Expires: December 18, 2006                                    K. Kinnear
                                                     Cisco Systems, Inc.
                                                           J. Brzozowski
                                                           Comcast Cable
                                                           June 16, 2006


                 DHCPv6 Relay Agent Echo Request Option
                   draft-szeng-dhc-dhcpv6-ero-01.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on December 18, 2006.

Copyright Notice

   Copyright (C) The Internet Society (2006).

Abstract

   This memo defines a Relay Agent Echo Request option for the Dynamic
   Host Configuration Protocol for IPv6 (DHCPv6).  The option allows a
   DHCPv6 relay agent to request a list of relay agent options that the
   server echoes back to the relay agent.




Zeng, et al.            Expires December 18, 2006               [Page 1]

Internet-Draft               Relay Agent ERO                   June 2006


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 3
   2.  Requirements Terminology  . . . . . . . . . . . . . . . . . . . 3
   3.  The Relay Agent Echo Request Option . . . . . . . . . . . . . . 3
   4.  DHCPv6 Relay Agent Behavior . . . . . . . . . . . . . . . . . . 4
   5.  DHCPv6 Server Behavior  . . . . . . . . . . . . . . . . . . . . 4
   6.  Security Considerations . . . . . . . . . . . . . . . . . . . . 5
   7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 5
   8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 5
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 5
     9.1.  Normative References  . . . . . . . . . . . . . . . . . . . 5
     9.2.  Informative References  . . . . . . . . . . . . . . . . . . 5
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . . . 7
   Intellectual Property and Copyright Statements  . . . . . . . . . . 8




































Zeng, et al.            Expires December 18, 2006               [Page 2]

Internet-Draft               Relay Agent ERO                   June 2006


1.  Introduction

   DHCPv6 [2] provides a framework for configuring IPv6 clients with
   addresses and other network parameters.  It includes a relay agent
   capability.  A relay agent is an intermediary node that delivers DHCP
   messages between clients and servers.  The relay agent and the server
   exchange information using options in relay agent messages.  The
   relay agent may add relay agent options to the client DHCP message
   before forwarding it.

   The information that relay agents supply can be used in the server's
   decision making about the addresses, delegated prefixes, and
   configuration parameters that the client is to receive.  Likewise,
   the relay may need some of the information to efficiently return
   replies to clients.

   In DHCPv4, the server generally echoes the relay agent option back
   verbatim to the relay agent in server-to-client replies [3].
   However, DHCPv6 [2] does not require the server to do so.  As matter
   of fact, for certain relay agent options, the server is required to
   echo back the options only if it recognizes them (e.g., [5], [6]).
   This could be problematic, as the relay agent may need to use some
   relay options even if the server does not recognize them.

   This memo defines a relay agent echo request option that the relay
   agent uses to explicitly request a list of options that the server
   echoes back to the relay agent.


2.  Requirements Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [1].


3.  The Relay Agent Echo Request Option

   The relay agent adds options in the Relay Forward message that the
   server uses to guide its decision making with regard to address
   assignment, prefix delegation, and configuration parameters.  The
   relay agent also knows which of these options that it will need to
   efficiently return replies to the client.  It uses the relay agent
   Echo Request option to inform the server the list of relay agent
   options that the server must echo back.






Zeng, et al.            Expires December 18, 2006               [Page 3]

Internet-Draft               Relay Agent ERO                   June 2006


   The format of the DHCPv6 Relay Agent Echo Request option is shown
   below:




    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           OPTION_ERO          |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    requested-option-code-1    |    requested-option-code-2    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                              ...                              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   option-code       OPTION_ERO (TBD).
   option-len        2 * number of requested options.
   requested-option-code-n The option code for an option requested by
   the relay agent.




4.  DHCPv6 Relay Agent Behavior

   A relay agent MAY include an Echo Request option in a Relay Forward
   message to inform the server about options the relay agent wants the
   server to echo back to the relay agent.  If the relay agent takes
   different actions based on whether an option is echoed back or not,
   then the relay agent SHOULD NOT include such an option in the Echo
   Request option.  Note that the relay uses the OPTION_ORO [2] to
   request the server to return options (e.g., [7]) other than relay
   agent options in the Relay Forward message.


5.  DHCPv6 Server Behavior

   When a server creates a Relay-Reply, it SHOULD perform ERO processing
   after processing the ORO and other options processing.  For each
   option in the ERO:
   a.  If the option is already in the Relay-Reply, the server MUST
       ignore that option and continue to process any remaining options
       in the ERO.
   b.  If the option was not in the received Relay-Forward, the server
       MUST ignore that option and continue to process any remaining
       options in the ERO.




Zeng, et al.            Expires December 18, 2006               [Page 4]

Internet-Draft               Relay Agent ERO                   June 2006


   c.  Otherwise, the server MUST copy the option, verbatim, from the
       received Relay-Forward to the Relay-Reply, even if the server
       does not otherwise recognize that option.


6.  Security Considerations

   As the Echo Request option is only exchanged between relay agents and
   DHCPv6 servers, [2] section 21.1, provides details on securing DHCPv6
   messages sent between servers and relay agents.  And, [2] section 23,
   provides general DHCPv6 security considerations.


7.  IANA Considerations

   IANA is requested to assign a DHCPv6 option code for the OPTION_ERO
   (Relay Agent Echo Request) Option.


8.  Acknowledgements

   Thanks to Ralph Droms, Josh Littlefield, Richard Johnson, and Hemant
   Singh for their consistent input, ideas and review during the
   production of this document.


9.  References

9.1.  Normative References

   [1]  Bradner, S., "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997.

   [2]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C., and M.
        Carney, "Dynamic Host Configuration Protocol for IPv6 (DHCPv6)",
        RFC 3315, July 2003.

   [3]  Patrick, M., "DHCP Relay Agent Information Option", RFC 3046,
        January 2001.

9.2.  Informative References

   [4]  Troan, O. and R. Droms, "IPv6 Prefix Options for Dynamic Host
        Configuration Protocol (DHCP) version 6", RFC 3633,
        December 2003.

   [5]  Volz, B., "DHCPv6 Relay Agent Subscriber-ID Option",
        draft-ietf-dhc-dhcpv6-subid-01 (work in progress), March 2006.



Zeng, et al.            Expires December 18, 2006               [Page 5]

Internet-Draft               Relay Agent ERO                   June 2006


   [6]  Volz, B., "DHCPv6 Relay Agent Remote ID Option",
        draft-ietf-dhc-dhcpv6-remoteid-01 (work in progress),
        March 2006.

   [7]  Droms, R., "DHCP Relay Agent Assignment Notification Option",
        draft-ietf-dhc-dhcpv6-agentopt-delegate-00 (work in progress),
        January 2006.












































Zeng, et al.            Expires December 18, 2006               [Page 6]

Internet-Draft               Relay Agent ERO                   June 2006


Authors' Addresses

   Shengyou Zeng
   Cisco Systems, Inc.
   1414 Massachusetts Ave.
   Boxborough, MA  01719
   USA

   Phone: +1 978 936 0000
   Email: szeng@cisco.com


   Bernard Volz
   Cisco Systems, Inc.
   1414 Massachusetts Ave.
   Boxborough, MA  01719
   USA

   Phone: +1 978 936 0000
   Email: volz@cisco.com


   Kim Kinnear
   Cisco Systems, Inc.
   1414 Massachusetts Ave.
   Boxborough, MA  01719
   USA

   Phone: +1 978 936 0000
   Email: kkinnear@cisco.com


   John Jason Brzozowski
   Comcast Cable
   1800 Bishops Gate Boulevard
   Mt. Laurel, NJ  08054
   USA

   Phone: +1 856 324 2671
   Email: john_brzozowski@cable.comcast.com











Zeng, et al.            Expires December 18, 2006               [Page 7]

Internet-Draft               Relay Agent ERO                   June 2006


Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Copyright Statement

   Copyright (C) The Internet Society (2006).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.


Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.




Zeng, et al.            Expires December 18, 2006               [Page 8]


